app/controllers/animals_controller.rb

  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save
---
INSERT INTO "animals" ("name", "kind", "breed", "vaccined", "castrated", "sex", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_animal
      @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", 1]]