app/controllers/posts_controller.rb

INSERT INTO "posts" ("text", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Post 1"], ["location", "Here"], ["created_at", "2016-09-02 02:53:05.054759"], ["updated_at", "2016-09-02 02:53:05.054759"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save